In [11]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
%matplotlib inline

In [12]:
columns = ['user_id','item_id','rating','timestamp']
dataset = pd.read_csv('data/u.data',sep = '\t',names = columns)

In [13]:
dataset.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [15]:
movie_info = pd.read_csv('data/Movie_Id_Titles')
movie_info.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [21]:
movie_merge = pd.merge(movie_info,dataset, on = 'item_id')
movie_merge.head()

   item_id             title  user_id  rating  timestamp
0        1  Toy Story (1995)      308       4  887736532
1        1  Toy Story (1995)      287       5  875334088
2        1  Toy Story (1995)      148       4  877019411
3        1  Toy Story (1995)      280       4  891700426
4        1  Toy Story (1995)       66       3  883601324

In [23]:
movie_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100003 entries, 0 to 100002
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   item_id    100003 non-null  int64
 1   title      100003 non-null  object
 2   user_id    100003 non-null  int64
 3   rating     100003 non-null  int64
 4   timestamp  100003 non-null  int64
dtypes: int64(4), object(1)
memory usage: 4.6+ MB